# config.py

from typing import List

ZAPOVIT = """
Як умру, то поховайте
Мене на могилі,
Серед степу широкого,
На Вкраїні милій,
Щоб лани широкополі,
І Дніпро, і кручі
Було видно, було чути,
Як реве ревучий.
Як понесе з України
У синєє море
Кров ворожу... отойді я
І лани і гори —
Все покину і полину
До самого Бога
Молитися... а до того
Я не знаю Бога.
Поховайте та вставайте,
Кайдани порвіте
І вражою злою кров'ю
Волю окропіте.
І мене в сем'ї великій,
В сем'ї вольній, новій,
Не забудьте пом'янути
Незлим тихим словом.
"""

CONTRA_SPEM_SPERO = """
Гетьте, думи, ви хмари осінні!
Тож тепера весна золота!
Чи то так у жалю, в голосінні
Проминуть молодії літа?
Ні, я хочу крізь сльози сміятись,
Серед лиха співати пісні,
Без надії таки сподіватись,
Жити хочу! Геть, думи сумні!
Я на вбогім сумнім перелозі
Буду сіяти барвисті квітки,
Буду сіяти квітки на морозі,
Буду лить на них сльози гіркі.
І від сліз тих гарячих розтане
Та кора льодовая, міцна,
Може, квіти зійдуть — і настане
Ще й для мене весела весна.
Я на гору круту крем'яную
Буду камінь важкий підіймать
І, несучи вагу ту страшную,
Буду пісню веселу співать.
В довгу, темную нічку невидну
Не стулю ні на хвильку очей,
Все шукатиму зірку провідну,
Ясну владарку темних ночей.
"""

CORPUS: List[str] = [ZAPOVIT, CONTRA_SPEM_SPERO]